/*	Задание 06. Caterpillar (гусиница)
*
*	Гусиница ползёт по вертикальному шесту высотой H метров, 
*	поднимаясь за день на A метров, а за ночь спускаясь на B метров.
*	На какой день гусиница доползёт до вершины шеста?
*
*	Формат входных данных [input]
*	Программа получает на вход целые неотрицательные числа H, A, B, причем H > B и A > B.
*	Числа не превосходят 100.
*
*	Формат выходных данных [output]
*	Программа должна вывести одно натуральное число.
*
*	[Sample function input]: 10 3 2
*	[Sample function output]: 8
*/

#include "Tasks.h"

int task06(int h, int a, int b) {
	return 0;
}