/*	Задание 02. Электронные часы
*
*	Электронные часы показывают время в формате h:mm:ss (от 0:00:00 до 23:59:59),
*	т.е. сначала записывается количество часов, потом обязательно двузначное количество минут,
*	затем обязательно двузначное количество секунд.
*	Количество минут и секунд при необходимости дополняются до двузначного числа нулями.
*	С начала суток прошло N секунд. Выведите, что покажут часы.
*
*	Формат входных данных [input]
*	На вход дается натурально число N, не превосходящее 10_000_000.
*
*	Формат выходных данных
*	Выведите ответ на задачу.
*
*	[Sample function input 1]: 3602
*	[Sample function output 1]: 1:00:02
*
*	[Sample function input 2]: 129700
*	[Sample function output 2]: 12:01:40
*/

#include "Tasks.h"

string task02(int number) {

	int hour = number / 3600 % 24;
	int min = number % 3600 / 60;
	int sec = number % 3600 % 60;

	string result = to_string(hour);
	result += ((min < 10) ? ":0" : ":") + to_string(min);
	result += ((sec < 10) ? ":0" : ":") + to_string(sec);
	
	return result;
}
