/*	Задание 05. МКАД
*
*	Длина Минской кольцевой автомобильной дороги примерно равна 56 километров.
*	Байкер Александер стартует с нулевого километра МКАД и едет со скоростью V километров в час.
*	На какой отметке он остановится через T часов?
*
*	Формат входных данных [input]
*	Программа получает на вход целые числа V и T.
*	Если V > 0, то Александер движется в положительном направлении по МКАД,
*	если же значение V < 0, то в отрицательном. 0 ≤ T ≤ 1000, -1000 ≤ V ≤ 1000
*
*	Формат выходных данных [output]
*	Программа должна вывести целое число от 0 до 56 — номер отметки,
*	на которой остановится Александер.
*
*	[Sample function input 1]: 40 2
*	[Sample function output 1]: 24
*
*	[Sample function input 2]: -1 1
*	[Sample function output 2]: 55
*/

#include "Tasks.h"

int task05(int v, int t) {
	return 0;
}